In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_excel("sales_data.xlsx")

In [3]:
df.head(10)

,Order ID,Customer Name,Product Category,Product Name,Order Date,Delivered Date,Quantity,Unit Price,Status,Country,Payment Method,Unnamed: 11,Unnamed: 12
0,1,Allison Hill,Electronics,Smartphone,45432,2024-05-24,4,238.0,Completed,Australia,Mobile Money,NaN,NaN
1,2,Lance Hoffman,Books,Fiction,45594,2024-11-04,7,42.0,Completed,Australia,Credit Card,NaN,NaN
2,3,Brent Abbott,Apparel,Sneakers,45593,2024-11-07,5,838.0,Completed,United Kingdom,Credit Card,NaN,NaN
3,4,Edward Fuller,Groceries,Cereal,45434,2024-05-27,3,230.0,Completed,United Kingdom,Credit Card,NaN,NaN
4,5,Melinda Jones,Electronics,Headphones,45566,2024-10-17,2,954.0,Returned,China,Cash,NaN,NaN
5,6,Andrew Stewart,Home Decor,Vase,45477,2024-07-10,10,206.0,Completed,Nigeria,Cash,NaN,NaN
6,7,Nicole Patterson,Groceries,Cereal,45375,2024-04-05,6,373.0,Returned,Australia,Cash,NaN,NaN
7,8,Anthony Rodriguez,Electronics,Camera,45617,2024-12-01,3,556.0,Completed,Nigeria,Credit Card,NaN,NaN
8,9,Shannon Smith,Groceries,Milk,45430,2024-05-22,9,234.0,Completed,Nigeria,Credit Card,NaN,NaN
9,10,Pamela Romero,Apparel,T-Shirt,45453,2024-06-25,7,284.0,Returned,Australia,Credit Card,NaN,NaN

In [4]:
df.tail(10)

,Order ID,Customer Name,Product Category,Product Name,Order Date,Delivered Date,Quantity,Unit Price,Status,Country,Payment Method,Unnamed: 11,Unnamed: 12
546,546,Donald Wilson,Apparel,Sneakers,45883,2025-08-16,7,70.0,Completed,United States,Bank Transfer,NaN,NaN
547,547,Jonathan Parks,Electronics,Camera,45919,2025-09-22,2,722.0,Completed,China,Bank Transfer,NaN,NaN
548,548,Ashley Freeman,Groceries,Juice,46002,2025-12-19,2,876.0,Returned,United States,Mobile Money,NaN,NaN
549,549,Kimberly Gibson,Apparel,Sneakers,45787,2025-05-17,8,281.0,Completed,Nigeria,Cash,NaN,NaN
550,550,Dawn Diaz,Electronics,Headphones,45757,2025-04-17,7,390.0,Returned,United States,Bank Transfer,NaN,NaN
551,551,Morgan Davenport,Home Decor,Table Lamp,45934,2025-10-10,5,953.0,Completed,United Kingdom,Cash,NaN,NaN
552,552,Theresa Hansen,Home Decor,Curtains,45666,2025-01-21,6,323.0,Returned,United States,Mobile Money,NaN,NaN
553,553,Krista Shea,Home Decor,Wall Art,45713,2025-03-01,3,380.0,Completed,United Kingdom,Bank Transfer,NaN,NaN
554,554,Rebecca Thompson,Books,Fiction,45897,2025-09-05,10,509.0,Returned,United States,Mobile Money,NaN,NaN
555,555,Donald Schultz,Groceries,Cereal,45743,2025-04-01,1,968.0,Completed,Nigeria,Cash,NaN,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 556 entries, 0 to 555
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          556 non-null    int64
 1   Customer Name     556 non-null    object
 2   Product Category  556 non-null    object
 3   Product Name      556 non-null    object
 4   Order Date        556 non-null    int64
 5   Delivered Date    556 non-null    datetime64[ns]
 6   Quantity          556 non-null    int64
 7   Unit Price        555 non-null    float64
 8   Status            556 non-null    object
 9   Country           556 non-null    object
 10  Payment Method    556 non-null    object
 11  Unnamed: 11       0 non-null      float64
 12  Unnamed: 12       1 non-null      object
dtypes: datetime64[ns](1), float64(2), int64(3), object(7)
memory usage: 56.6+ KB

# Drop Unwanted Columns

In [6]:
df=df.drop(columns=["Unnamed: 11","Unnamed: 12"])

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 556 entries, 0 to 555
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          556 non-null    int64
 1   Customer Name     556 non-null    object
 2   Product Category  556 non-null    object
 3   Product Name      556 non-null    object
 4   Order Date        556 non-null    int64
 5   Delivered Date    556 non-null    datetime64[ns]
 6   Quantity          556 non-null    int64
 7   Unit Price        555 non-null    float64
 8   Status            556 non-null    object
 9   Country           556 non-null    object
 10  Payment Method    556 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(3), object(6)
memory usage: 47.9+ KB

Dropped unnecessary columns(Unnamed: 11 and Unnamed: 12) that were not relevant for analysis.

# Rename Column Headers

In [8]:
df.columns

Index(['Order ID', 'Customer Name', 'Product Category', 'Product Name',
       'Order Date', 'Delivered Date', 'Quantity', 'Unit Price', 'Status',
       'Country', 'Payment Method'],
      dtype='object')

In [9]:
df.columns=df.columns.str.strip().str.lower().str.replace(" ","_")

In [10]:
df.columns

Index(['order_id', 'customer_name', 'product_category', 'product_name',
       'order_date', 'delivered_date', 'quantity', 'unit_price', 'status',
       'country', 'payment_method'],
      dtype='object')

Standardized column names by converting them to lowercase, stripping whitespace, and replacing spaces with underscores for consistency.

# Check and Fix Datatype for Columns

In [11]:
df.dtypes

order_id                     int64
customer_name               object
product_category            object
product_name                object
order_date                   int64
delivered_date      datetime64[ns]
quantity                     int64
unit_price                 float64
status                      object
country                     object
payment_method              object
dtype: object

In [12]:
df["order_date"]=pd.to_datetime(df["order_date"])

In [13]:
df.dtypes

order_id                     int64
customer_name               object
product_category            object
product_name                object
order_date          datetime64[ns]
delivered_date      datetime64[ns]
quantity                     int64
unit_price                 float64
status                      object
country                     object
payment_method              object
dtype: object

Converted the order_date column to datetime format for proper time-based operations.

# Remove Duplicate Rows

In [14]:
print(df.duplicated().sum())

1

In [15]:
print(df["order_id"].duplicated().sum())

1

In [16]:
df=df.drop_duplicates()

Removed duplicates rows using drop_duplicates() and checked for duplicated order_ids.

# Identify and Handle Missing Values

In [17]:
df.isnull().sum()

order_id            0
customer_name       0
product_category    0
product_name        0
order_date          0
delivered_date      0
quantity            0
unit_price          1
status              0
country             0
payment_method      0
dtype: int64

In [18]:
print(df["unit_price"].mean())

496.9530685920578

In [19]:
df["unit_price"]=df["unit_price"].replace(np.nan,496.0)

In [20]:
print(df["unit_price"].mean())

496.9513513513514

Handled missing values in the unit_price column by replacing NaN values with the column's mean(496.0)